export const privacyContent = `
프리뷰인슈는 회원서비스 처리를 위하여 고객으로부터 최소한의 필수정보를 수집하며, 제공한 모든 개인정보는 별도의 동의가 없는 한 해당 목적 이외의 다른 목적으로 사용하지 않습니다. 

수집항목

최초 회원가입 시 회원 식별 및 최적화된 서비스 제공을 위해 아래와 같은 정보를 수집합니다. 

• 필수정보 : 소셜 이메일 주소, 소셜 고유 키 값, 프로필 정보(프로필 사진), 언어 환경설정 등 본인을 위한 정보. (본인 식별을 위한 정보 추가 수집 항목은 본인 확인을 위해 정보를 받으나 저장하지 않습니다.)
• 선택정보 : 성별, 나이, 보유하고 있는 보험사 정보

수집 및 목적

프리뷰인슈가 수집한 개인정보는 다음의 목적을 위해 활용합니다.

가. 입력된 정보에 기반한 상품 추천 : 콘텐츠 제공, 예상 결제 금액 안내, 관련 상품 추천 

나. 회원 관리 : 회원제 서비스 이용에 따른 본인 확인, 개인식별, 불량회원의 부정 이용 방지와 비인가 사용 방지, 가입 의사 확인, 가입 및 가입횟수 제한, 분쟁 조정을 위한 기록보존, 불만처리 등 민원처리, 고지사항 전달 

다. 마케팅 및 광고에 활용 : 신규 서비스(제품) 개발 및 특화, 접속 빈도 파악, 회원의 서비스 이용에 대한 통계, 신규 기능 및 정보 변경 안내 

보유 및 이용기간

정보 주체로부터 개인정보 수집 시에 동의 받은 개인정보 보유 및 이용기간 내에서만 개인정보를 처리 및 보유하며, 다른 목적으로는 절대 이용하지 않습니다.단, 전자상거래 등에서의 소비자보호에 관한 법률, 통신비밀보호법 등 관계법령의 규정에 의하여 보존할 필요가 있는 경우 회사는 관계법령에서 정한 일정한 기간 동안 개인정보를 보관합니다.

<span >• 보존항목 : 소셜 이메일 주소, 소셜 고유 키 값</span>
<span >• 보존 이유 : 부정 이용 방지, 서비스 이용 기간 및 요금 관련 분쟁 해결</span>
<span >• 보존 기간 : 회원 탈퇴 완료일로부터 1년</span>

<span > 고객님은 개인정보 수집 및 이용 동의를 거부할 권리가 있습니다. 다만 개인정보 수집 및 이용 동의를 거부하실 경우, 회원 등록을 하실 수 없고, 이에 따른 회원제 서비스 이용이 불가할 수 있습니다.</span>
`;

export const advertiseAgreeContent = `
프리뷰인슈의 제휴 서비스의 이벤트・혜택 등의 정보 발송을 위해 소셜 이메일 주소(아이디 식별값 포함)를 수집합니다. 

소셜 이메일 주소는 프리뷰인슈 서비스 제공을 위한 필수 수집항목으로서 프리뷰인슈 회원 가입 기간 동안 보관하나, 이벤트 혜택 정보 수신 동의를 철회하시면 본 목적으로의 개인정보 처리는 중지됩니다. 정보주체는 개인정보 수집 및 이용 동의를 거부하실 수 있으며, 미동의 시에도 서비스 이용은 가능합니다. 

※ 일부 서비스(별개의 회원체계 운영, 프리뷰인슈 가입 후 추가 가입하는 서비스 등)의 경우, 수신에 대해 별도로 안내 드리며, 동의를 구합니다.
`;
