import styled from 'styled-components';
import ReactMarkdown from 'react-markdown';
import Markdown from 'react-markdown';
import media from '@styles/media';

export const policyPrivacyContent = `프리뷰인슈(이하 "회사" 또는 "프리뷰인슈"라 함)는 개인정보보호를 매우 중요시하며, 개인 회원 정보의 이용 및 보호에 관한 법률, 정보보호 등에 관한 법률, 개인정보보호법 등 관계법령의 규정을 준수하여 개인정보를 최선을 다합니다. 개인정보를 보호함은 물론 개인정보보호법에 의거한 개인정보 처리방침을 통하여 정보주체의 개인정보보호 및 권익을 보호하고 이와 관련한 고충을 원활하게 처리할 수 있도록 합니다.

이 방침은 회사의 정책에 따라 수시로 변경될 수 있으며, 중요한 내용이 변경되는 경우에는 이용자가 변경 내용을 확인할 수 있도록 공개하고 있습니다.

제 1 장. 개인정보의 수집 및 이용 목적
제 2 장 수집하는 개인정보 항목 및 수집방법
제 3 장 수집한 개인정보의 보유 및 이용기간
제 4 장 개인정보의 파기절차 및 방법
제 5 장 개인정보의 제공 및 공유
제 6 장 개인정보 자동 수집 장치의 설치, 운영 및 거부에 관한 사항
제 7 장 개인정보의 안전성 확보 조치
제 8 장 이용자 권리와 그 행사방법 및 회원 탈퇴
제 9 장 개인정보 보호책임자 및 담당자 안내
제 10 장 고지

### **제 1 장. 개인정보의 수집 및 이용 목적**

프리뷰인슈가 수집한 개인정보는 다음의 목적을 위해 활용합니다.

가. 입력된 정보에 기반한 상품 추천 : 콘텐츠 제공, 예상 결제 금액 안내, 관련 상품 추천

나. 회원 관리 : 회원제 서비스 이용에 따른 본인 확인, 개인식별, 불량회원의 부정 이용 방지와 비인가 사용 방지, 가입 의사 확인, 가입 및 가입횟수 제한, 분쟁 조정을 위한 기록보존, 불만처리 등 민원처리, 고지사항 전달

다. 마케팅 및 광고에 활용 : 신규 서비스(제품) 개발 및 특화, 접속 빈도 파악, 회원의 서비스 이용에 대한 통계, 신규 기능 및 정보 변경 안내

### **제 2 장 수집하는 개인정보 항목 및 수집방법**

[ 수집하는 개인정보 항목 ]

가. 최초 회원가입 시 회원 식별 및 최적화된 서비스 제공을 위해 아래와 같은 정보를 수집합니다.

1. 필수정보 : 소셜 이메일 주소, 소셜 고유 키 값, 프로필 정보(프로필 사진), 언어 환경설정 등 본인을 위한 정보. (본인 식별을 위한 정보 추가 수집 항목은 본인 확인을 위해 정보를 받으나 저장하지 않습니다.)
2. 선택정보 : 성별, 나이, 보유하고 있는 보험사 정보

나. 상담서비스를 위하여 아래와 같은 개인정보를 수집합니다.(필수) 이메일, 닉네임

다. 개별 서비스 이용 과정에서, 이용하는 보험사에 대한 정보를 추가로 수집할 수 있습니다.

[ 수집방법 ]

홈페이지를 통한 회원가입, 온보딩 기능, AI 질문 게시판 등으로 개인정보를 수집합니다.

### **제 3 장 수집한 개인정보의 보유 및 이용기간**

정보 주체로부터 개인정보 수집 시에 동의 받은 개인정보 보유 및 이용기간 내에서만 개인정보를 처리 및 보유하며, 다른 목적으로는 절대 이용하지 않습니다.단, 전자상거래 등에서의 소비자보호에 관한 법률, 통신비밀보호법 등 관계법령의 규정에 의하여 보존할 필요가 있는 경우 회사는 관계법령에서 정한 일정한 기간 동안 개인정보를 보관합니다. 

- 소비자의 불만 또는 분쟁처리를 위한 계정 정보 기록ㆍ보존
이유 : 전자상거래 등에서의 소비자보호에 관한 법률
보존 정보 : 소셜 이메일 주소, 소셜 고유 키 값 
보존 기간 : 1년

### **제 4 장 개인정보의 파기절차 및 방법**

회사는 원칙적으로 개인정보 수집 및 이용목적이 달성되거나, 보유 및 이용기간이 경과된 후에 는 해당 정보를 지체없이 파기합니다. 다만, 부정 이용 방지 및  위하여 회원정보(ID, 주문처리 정보)를 회원 탈퇴 완료일로부터 1년간 보관합니다.파기절차 및 방법은 다음과 같습니다.

가. 파기절차 : 회원이 회원가입 등을 위해 입력한 정보는 목적이 달성된 후 내부 방침 및 관련 법령에 따라 일정 기간 저장된 후 파기됩니다.

나. 파기방법 : 종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여 파기하고 전자적 파일형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다.

### **제 5 장 개인정보의 제공 및 공유**

원칙적으로 회사는 회원의 개인정보를 수집 및 이용목적에 한해서만 이용하며 타인 또는 타기업/기관에 공개하지 않습니다. 다만, 아래의 경우에는 예외로 합니다.

가. 법령의 규정에 의거하거나, 수사 목적으로 법령에 정해진 절차와 방법에 따라 수사기관의 요구가 있는 경우

나. 문의에 대한 답변 및 업무상 연락을 위하여, 이용목적에 부합하는 개인정보의 이용 및 제공

다. 그 밖에 개인정보 제3자 제공이 필요한 경우에는 이용자의 동의를 얻는 등 적법한 절차를 통하여 제3자에게 개인정보를 제공할 수 있습니다. 회사는 이용자들의 서비스 이행을 위하여 필요한 경우 이용자의 동의를 얻는 등 적법한 절차를 통하여 아래와 같이 개인정보를 제공할 수 있습니다.

라. 타 보험사와 프로모션 혹은 이벤트를 진행할 경우, 별도 동의 절차를 진행하여 타기업/기관에 해당 이벤트를 동의한 사용자만 정보를 제공합니다. 이벤트에 대한 동의 절차는 각 이벤트의 상황에 맞춰 독립적으로 진행됩니다.

### **제 6 장 개인정보 자동 수집 장치의 설치, 운영 및 거부에 관한 사항**

회원 개개인에게 개인화되고 맞춤화된 서비스를 제공하기 위해서 회사는 회원의 정보를 저장하고 수시로 불러오는 '쿠키(cookie)'와 로그 분석툴인 Google Analytics 도구를 사용하고 있습니다.

가. 쿠키란?쿠키는 웹사이트를 운영하는데 이용되는 서버가 사용자의 브라우저에게 보내는 조그마한 데이터 꾸러미로 회원 컴퓨터의 하드디스크에 저장됩니다.

쿠키의 사용 목적회원과 비회원의 접속 빈도나 방문 시간 등을 분석, 이용자의 취향과 관심분야를 파악하여 서비스 제공에 활용합니다.

나. Google Analytics 분석 툴구글 애널리틱스(Google Analytics)는 Google Inc.,(이하 "구글")에서 제공하는 웹 분석 서비스입니다. 구글 애널리틱스(Google Analytics)는 이용자와 웹사이트 간의 상호 작용을 분석함으로써 웹사이트를 더욱 개선하기 위해 사용될 수 있는 웹 분석 도구입니다.

Google Analytics 분석툴의 사용 목적Google Analytics의 쿠키 및 식별자를 이용하여 인구 통계, 관심 분야에 대한 잠재고객 생성 및 리마케팅 목록을 기반으로 구글 디스플레이 네트워크와 검색 광고 캠페인에 대한 관련 광고를 제공합니다.

다. 쿠키 및 로그 분석 설정 거부 방법회원은 쿠키 설치에 대한 선택권을 가지고 있습니다. 따라서, 회원은 웹브라우저에서 옵션을 설정함으로써 모든 쿠키를 허용하거나, 쿠키가 저장될 때마다 확인을 거치거나, 아니면 모든 쿠키의 저장을 거부할 수 있습니다.설정방법1) Chrome의 경우: 웹 브라우저 우측 상단의 더보기 > 설정 > 개인정보 및 보안 > 사이트 설정 > 쿠키 2) Google Analytics: Google Analytics 차단 브라우저 기능을 사용(https://tools.google.com/dlpage/gaoptout)

단, 쿠키 설치를 거부하였을 경우 일부 서비스의 이용이 어려울 수 있습니다.

### **제 7 장 개인정보의 안전성 확보 조치**

프리뷰인슈는 개인정보 보호법 제29조에 따라 다음과 같이 안전성 확보에 필요한 기술적/관리적 및 물리적 조치를 하고 있습니다.

가. 개인정보 취급 직원의 최소화 및 교육개인정보를 취급하는 직원을 지정하고 최소화하여 개인정보를 관리하는 대책을 시행하고 있습니다.

나. 서비스 제공에 필요한 최소한의 정보만 수집하여, 개인정보 유출의 위험을 사전에 방지합니다. 

다. 해킹 등에 대비한 기술적 대책 : 프리뷰인슈는 해킹이나 컴퓨터 바이러스 등에 의한 개인정보 유출 및 훼손을 막기 위하여 보안프로그램을 설치하고 주기적인 갱신·점검을 하며 외부로부터 접근이 통제된 구역에 시스템을 설치하고 기술적, 물리적으로 감시 및 차단하고 있습니다.

라. 이용자의 개인정보는 암호화되어 저장 및 관리되고 있어 본인만이 알 수 있으며 중요한 데이터는 파일 및 전송 데이터를 암호화하거나 파일 잠금 기능을 사용하는 등 별도 보안기능을 사용하고 있습니다.

마. 문서보안을 위한 잠금장치 사용개인정보가 포함된 서류, 보조저장매체 등을 잠금 장치가 있는 안전한 장소에 보관하고 있습니다.

### **제 8 장 이용자 권리와 그 행사방법 및 회원 탈퇴**

가. 이용자는 언제든지 등록되어 있는 자신의 개 인정보를 열람하거나 수정할 수 있으며 가입 해지를 요청할 수 있습니다. 이용자의 개인정보 열람 및 수정은 ‘로그인 후 계정 아이콘 클릭 혹은 마이 탭’에서 확인할 수 있습니다. 가입 해지는 ‘마이페이지 > 회원탈퇴’에서 할 수 있습니다.

나. 이용자는 개인정보의 열람, 수정, 탈퇴, 처리정지 요구할 권리를 행사할 수 있고 접수·처리 경로는 아래와 같습니다.
프리뷰인슈 문의 창구 : [reviewInsue@gmail.com](mailto:reviewInsue@gmail.com) 

[ 14세 미만 아동의 회원 가입에 대해 ]

프리뷰인슈는 만 14세 미만 아동의 회원가입은 받고 있지 않습니다.

### **제 9 장 개인정보 보호책임자 및 상담, 신고**

회원의 개인정보를 보호하고 개인정보와 관련한 불만을 처리하기 위하여 회사는 개인정보 보호책임자를 두고 있습니다. 회원의 개인정보와 관련한 문의사항은 아래의 프리뷰인슈 문의창구를 통해 담당자에게 연락하시기 바랍니다.

프리뷰인슈 문의 창구 : [reviewInsue@gmail.com](mailto:reviewInsue@gmail.com) 

프리뷰인슈 개인정보 보호 책임자 : [https://lilee.notion.site/MEMBER-3ba7da7730be4143a2be2cf7e99f3c16?pvs=4](https://www.notion.so/MEMBER-3ba7da7730be4143a2be2cf7e99f3c16?pvs=21)

### **제 10 장 고지**

법령.정책 또는 보안기술의 변경에 따라 내용의 추가.삭제 및 수정이 있을 시에는 웹사이트에 개정 정책을 고지합니다. 단, 회원에게 불리한 내용이 포함된 경우 변경사항 시행일의 30일전부터 변경 내용을 고지합니다.

공고 일자 : 2024년 8월 10일

시행 일자 : 2024년 8월 20일`;

const PolicyPrivacyScreen = () => {
  return (
    <>
      <Head>개인정보 처리방침</Head>

      <Subtitle>|ㅤ개인정보 처리방침</Subtitle>

      <Content>{policyPrivacyContent}</Content>
    </>
  );
};
const Head = styled.div`
  background: linear-gradient(90deg, #3e4895 0%, #6879fb 50%, #3e4895 100%);
  color: white;
  padding: 15rem;
  font-size: 5rem;
  font-weight: 600;
  text-align: center;
`;

const Subtitle = styled.h2`
  width: 80%;
  margin: 9.6rem auto 0 auto;
  color: ${({ theme }) => theme.colors.Primary500};
  font-size: 3rem;
  font-weight: 600;

  ${media.mobile`
    font-size: 16px;
  `}
`;

const Content = styled(Markdown)`
  width: 80%;
  margin: 7rem auto 20rem auto;
  color: ${({ theme }) => theme.colors.Black500};
  font-size: 2.5rem;
  font-weight: 400;
  white-space: pre-wrap;
  line-height: normal;

  ${media.mobile`
    font-size: 14px;
  `}
`;

export default PolicyPrivacyScreen;
