import media from '@styles/media';
import styled from 'styled-components';

export const policyServiceContent = `제1조 (목적)

본 약관은 프리뷰인슈 (이하 "회사" 또는 "프리뷰인슈"라 함)가 인터넷 상에서 제공하는 모든 서비스의 이용 조건 및 절차에 관한 기본적인 사항을 규정함을 목적으로 합니다.

제2조 (약관의 동의)

회원이 되고자 하는 자가 회사가 정한 로그인 및 회원가입의 절차를 거쳐서 회원등록을 하면 본 약관에 동의하는 것으로 간주합니다.

제3조 (약관의 효력과 개정)

• 가.이 약관은 그 내용을 회사의 웹사이트에 게시하거나 기타의 방법으로 회원에게 공시함으로써 효력이 발생합니다.
• 나.회사는 영업상 중요 사유, 사정 변경, 기타 회사가 필요하다고 인정하는 경우, 관련법을 위배하지 않는 범위에서 약관의 내용을 개정할 수 있으며, 변경된 약관은 전항과 같은 방법으로 효력이 발생됩니다.
• 다.개정된 약관의 효력은 원칙적으로 기존 회원에게도 적용됩니다.

제4조 (적용법규)

이 약관에 명시되지 않은 사항은 관계법령의 규정에 따릅니다.

제5조 (회원의 가입과 이용신청)

• 가.회원이 되고자 하는 자는 회사에서 요청하는 개인의 정보를 정확하게 제공해야 합니다.
• 나.회원 가입은 회원이 되고자 하는 자가 회원 약관에 동의하고 회원 등록을 신청할 경우 회사가 승낙함으로써 이루어집니다.
• 다.회사는 이용신청에 대하여 원칙적으로 즉시 이용신청을 승낙합니다.

제6조 (이용신청의 불승낙)

• 가.회사는 다음 각 호에 해당하는 경우 이용신청에 대하여 승낙을 하지 않을 수 있습니다.
    ◦ ②회원가입 신청서 내용의 일부 또는 전부를 허위로 하여 신청한 경우
    ◦ ③공공질서 또는 미풍양속을 저해할 목적으로 신청한 경우
• 나.회사는 이용신청에 대하여 승낙한 이후 해당 신청이 가)항 각 호에 해당하는 사실을 알았을 경우, 그 승낙을 취소할 수 있으며, 이 경우 해당 이용 신청은 처음부터 없었던 것이 됩니다.

제7조 (회원 정보의 보호)

• 가.회원의 개인정보는 약관의 운용목적 이외의 목적으로 사용하거나 회원의 승낙 없이 타인에게 누설하거나 배포하지 않습니다. 단, 관련법에 의한 국가기관 등의 요구가 있을 경우, 회원의 불법적이거나 미풍양속을 저해하는 행위로 인한 귀책사유의 경우에는 그러하지 않습니다.
• 나.회사는 회원의 개인정보보호를 위하여 "개인정보보호정책"을 수립하고 이를 준수합니다. "개인정보보호정책"은 최초 회원 가입시 이용약관과 함께 게재하고 있으며, 홈페이지 하단에 명시하여 언제라도 이용자가 그 내용을 확인할 수 있도록 하고 있습니다.
• 다.회원의 개인정보는 관계법령에 따른 회사의 개인정보처리방침 및 기타 내부운영방침에 의거하여 기술적, 물리적으로 안전하게 관리되고 있으며, 홈페이지고객의 개인정보와 금융거래고객의 개인정보는 회사 홈페이지의 첫 화면 하단에서 확인할 수 있는 홈페이지고객용 개인정보취급방침 및 금융거래고객용 개인정보처리방침에 의거하여 각 별개로 관리됩니다.

제8조 (서비스의 이용 및 제한)

• 가.서비스는 회사의 사정상 또는 기술상 특별한 사정이 있는 경우를 제외하고는 연중 무휴, 1일 24시간 이용을 원칙으로 합니다. 
• 나.회사가 제공하는 서비스 중 일부는 회사가 정한 별도의 로그인 및 정보입력 절차를 거쳐야만 이용할 수 있습니다.
• 다.회사는 컴퓨터 등 정보통신설비의 보수점검·교체 및 고장, 통신의 두절 등의 사유가 발생한 경우에는 서비스의 제공을 일시적으로 중단할 수 있고, 새로운 서비스로의 교체 또는 기타 회사가 적절하다고 판단하는 경우 현재 제공하는 서비스를 완전히 중단할 수 있습니다.
• 라.회사는 다항에 의한 서비스 중단 시 이용자에게 이를 공지하여야 합니다. 다만, 회사가 통제할 수 없는 사유로 인한 서비스의 중단 (회사의 고의 및 과실이 없는 시스템 장애, 국가관련 기관의 요청 등)으로 공지가 불가능한 경우에는 그러하지 않습니다.

제9조 (회사의 의무)
• 가.회사는 회원의 신용정보를 포함한 개인신상정보의 보안에 대하여 기술적 안전조치를 강구하고 관리에 만전을 기함으로써 회원의 개인정보 보안에 최선을 다해야 합니다.
• 나.회사는 서비스 이용에 관한 사항, 회사의 각종 행사 또는 정보 서비스에 대한 정보를 회사 홈페이지, 전자우편이나 서신우편, 전화 등의 방법으로 회원들에게 제공할 수 있습니다.

제10조 (회원의 의무)

• 가.회원은 본인의 개인정보가 분실, 도용, 위조 또는 변조되지 않도록 충분한 주의를 기울여야 하며, 이의 관리소홀 및 부정사용에 의하여 발생하는 모든 결과에 대한 책임은 회원이 부담합니다.
• 나.회원의 개인정보가 부정하게 사용된 경우에 회원은 즉시 관련 소셜 플랫폼의 계정 비밀번호를 바꾸고 그 사실을 회사에 통보해야 합니다.
• 다.회원은 회원의 귀책사유로 인하여 회사나 다른 회원이 입은 손해를 배상할 책임이 있습니다.
• 라.회원은 이 약관 및 관계법령에서 규정한 사항을 준수하여야 합니다.

제11조 (계약해지 및 서비스의 이용제한)

• 가.회원은 이용신청을 해지하고자 하는 경우 회사 웹사이트의 계정 상세 페이지인 "회원정보" 메뉴에서 탈퇴신청을 하여야 하며, 회사는 신속히 처리하여야 합니다.
• 나.회사는 회원의 서비스 이용행위가 다음 사항에 해당하는 경우 이용신청을 해지하거나 서비스의 이용을 중지할 수 있습니다.
    ◦ ①공공 질서 및 미풍양속에 반하는 경우
    ◦ ②범죄와 관련 있다고 추정되는 경우
    ◦ ③국익 또는 공공의 이익을 저해할 목적으로 서비스 이용을 계획 또는 실행 할 경우
    ◦ ④타인의 정보를 도용한 경우
    ◦ ⑤타인의 명예를 손상시키거나 불이익을 주는 경우
    ◦ ⑥같은 사용자가 다른 개인정보로 이중 등록을 한 경우
    ◦ ⑦서비스에 위해를 가하는 등 건전한 이용을 저해하는 경우
    ◦ ⑧기타 관계법령이나 회사가 정한 이용조건에 위배되는 경우
• 다.회사가 이용을 제한하고자 하는 경우에는 그 사유, 일시 및 기간을 정하여 전자우편 등의 방법으로 해당 회원 또는 대리인에게 통지합니다. 다만 회사가 긴급하게 이용을 정지할 필요가 있다고 인정하는 경우에는 그러하지 아니합니다.
• 라.회사는 이용정지기간 중에 그 이용제한사유가 해소된 것이 확인된 경우에는 이용정지조치를 즉시 해제합니다.

제12조 (공개게시물의 삭제)

회사는 회원의 공개게시물의 내용이 다음 각 항에 해당하는 경우에는 회원에게 사전 통지 없이 해당 공개게시물을 삭제할 수 있고, 해당 회원의 자격을 제한, 정지 또는 상실 시킬 수 있습니다.
• 가.다른 이용자 또는 제3자를 비방하거나 중상 모략으로 명예를 손상시키는 내용
• 나.공공질서와 미풍양속에 위반되는 내용의 정보, 문장, 도형 등을 유포하는 내용
• 다.범죄행위와 관련이 있다고 판단되는 내용
• 라.다른 이용자 또는 제3자의 저작권 등 기타 권리를 침해하는 내용
• 마.기타 관계 법령에 위배된다고 판단되는 내용

제13조 (저작권의 귀속 및 이용제한)

• 가.회사가 작성한 저작물에 대한 저작권 기타 지적재산권은 회사에 귀속합니다.
• 나.회원은 회사의 서비스를 이용함으로써 얻은 정보를 회사의 사전승낙 없이 복제, 전송, 출판, 배포, 방송 기타 방법에 의하여 영리목적으로 이용하거나 제3자에게 이용하게 하여서는 안됩니다.

제14조 (분쟁의 해결)

• 가.회사와 회원은 서비스와 관련하여 발생한 분쟁을 원만하게 해결하기 위하여 필요한 모든 노력을 하여야 합니다.
• 나.가)항의 규정에도 불구하고 회사와 회원사이에 소송이 제기될 경우, 소송은 회사의 본사 소재지를 관할하는 법원을 관할 법원으로 합니다.

제 15조(데이터의 활용과 서비스 관리)

가. 회사는 프리뷰인슈 서비스의 유지 및 개선을 위하여, 관계법령을 준수하는 범위에서 귀하가 입력한 데이터를 저장하여 프리뷰인슈 서비스 고도화 및 최적화 등의 목적으로 활용할 수 있습니다.

나. 회사는 프리뷰인슈 서비스의 오류 수정 및 성능개선 등을 위하여 프리뷰인슈 서비스를 업데이트할 수 있습니다.

제 16조 (법인의 책임 제한)

가. 회사는 프리뷰인슈 서비스의 완전성, 무결성, 적정성을 보증하지 않습니다.

나. 회사는 프리뷰인슈 서비스를 통해 귀하에게 제공한 상품 추천 및 답변의 정확성, 적절성을 보증하지 않습니다.

다. 이용자는 기능 작동 시 각 기능의 제공사, 제공되는 기능 및 조건 등 서비스에서 안내하는 내용을 확인할 책임이 있습니다.

라. 인공지능과 머신러닝은 빠르게 진화하는 산업 분야입니다. 법인은 서비스의 신뢰성 개선을 위해 지속적으로 노력하고 있으나, 머신러닝의 확률적 특성을 고려할 때 일부 상황에 대한 부정확한 출력이 발생할 수 있으므로, 귀하는 법률전문가의 판단 및 전문 보험설계사 등 개별적인 검토를 통해 출력된 답변의 정확성을 평가하여야 합니다.

마. 귀하는 프리뷰인슈 서비스를 자신의 책임하에, 본 이용약관과 관계법령을 준수하여 적법하게 이용하여야 하고, 회사는 귀하가 프리뷰인슈 서비스를 이용하여 위법행위를 한 경우 이에 대한 책임을 지지 않습니다.

부칙

공고 일자 : 2024년 8월 10일

시행 일자 : 2024년 8월 20일`;

const PolicyServiceScreen = () => {
  return (
    <>
      <Head>서비스 이용 약관</Head>

      <Subtitle>|ㅤ서비스 이용 약관</Subtitle>

      <Content>{policyServiceContent}</Content>
    </>
  );
};
const Head = styled.div`
  background: linear-gradient(90deg, #3e4895 0%, #6879fb 50%, #3e4895 100%);
  color: white;
  padding: 15rem;
  font-size: 5rem;
  font-weight: 600;
  text-align: center;
`;

const Subtitle = styled.h2`
  width: 80%;
  margin: 9.6rem auto 0 auto;
  color: ${({ theme }) => theme.colors.Primary500};
  font-size: 3rem;
  font-weight: 600;

  ${media.mobile`
    font-size: 16px;
  `}
`;

const Content = styled.p`
  width: 80%;
  margin: 7rem auto 20rem auto;
  color: ${({ theme }) => theme.colors.Black500};
  font-size: 2.5rem;
  font-weight: 400;
  white-space: pre-wrap;
  line-height: normal;

  ${media.mobile`
    font-size: 14px;
  `}
`;

export default PolicyServiceScreen;
